InformationRegisters/Renault_ПланПеремещения.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.17">
	<InformationRegister>
		<Properties>
			<Name>Renault_ПланПеремещения</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Автомобиль</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Автомобили</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>РабочийЛист</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СкладОтправитель</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СкладыКомпании</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СкладПолучатель</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СкладыКомпании</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Ответственный</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Сотрудники</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ДатаЗаписи</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Перемещено</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ВЗаявке</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ДокументПеремещения</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.ПеремещениеАвтомобилей</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ДатаПлан</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Продавец</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ДопОборудование</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ПНУ</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Зарезервировано</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>РабочиеОтметки</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>1000</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ЗаписьЗаблокирована</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Контрагент</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>ПотребностьПеремещения</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.Renault_ПотребностьПеремещения</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

InformationRegisters/Renault_КоличествоПеревозокВыдачВДень.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.17">
	<InformationRegister>
		<Properties>
			<Name>Renault_КоличествоПеревозокВыдачВДень</Name>
			<InformationRegisterPeriodicity>Second</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>КоличествоПеремещенийВыдач</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>2</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Дата</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ЭтоКоличествоДнейБлокировки</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Объект</Name>
					<Type>
						<v8:Type>cfg:EnumRef.Renault_ОбъектДляУстановкиКоличестваПеремещенийВыдач</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Территория</Name>
					<Comment>используется только для журнала выдачи</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.Renault_Территории</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

InformationRegisters/Renault_РазмещениеАвтомобилей.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.17">
	<InformationRegister>
		<Properties>
			<Name>Renault_РазмещениеАвтомобилей</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Автомобиль</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Автомобили</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Attribute>
				<Properties>
					<Name>Номер</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>Склад</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СкладыКомпании</v8:Type>
						<v8:Type>cfg:CatalogRef.Renault_Территории</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Место</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

AccumulationRegisters/Renault_АвтомобилиВРезерве.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.17">
	<AccumulationRegister>
		<Properties>
			<Name>Renault_АвтомобилиВРезерве</Name>
			<RegisterType>Balance</RegisterType>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Количество</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>1</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Автомобиль</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Автомобили</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Модель</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Модели</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Версия</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ВариантыКомплектации</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Цвет</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Цвета</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ДокументРезерва</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>10</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Контрагент</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>РабочийЛист</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Продавец</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Территория</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Renault_Территории</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</AccumulationRegister>
</MetaDataObject>

InformationRegisters/Renault_КомментарииКАвтомобилю.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.17">
	<InformationRegister>
		<Properties>
			<Name>Renault_КомментарииКАвтомобилю</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Автомобиль</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Автомобили</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

AccumulationRegisters/ОстаткиАвтомобилей.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.17">
	<AccumulationRegister>
		<Properties>
			<Name>ОстаткиАвтомобилей</Name>
			<Comment>Блок учета остатков автомобилей</Comment>
			<RegisterType>Balance</RegisterType>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Количество</Name>
					<Comment>Количественный остаток автомобиля на складе</Comment>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Сумма</Name>
					<Comment>Сумма в валюте регламентированного учета с налогами</Comment>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СуммаУпр</Name>
					<Comment>Сумма в валюте управленческого учета с налогами</Comment>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СуммаНДС</Name>
					<Comment>Сумма НДС в валюте регламентированного учета</Comment>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Attribute>
				<Properties>
					<Name>ХозОперация</Name>
					<Comment>Хозяйственная операция</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.ХозОперации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СтавкаНДС</Name>
					<Comment>Ставка НДС</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.СтавкиНДС</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>Автомобиль</Name>
					<Comment>Автомобиль</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.Автомобили</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>СкладКомпании</Name>
					<Comment>Склад компании</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.СкладыКомпании</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>СтатусПартии</Name>
					<Comment>Статус партии, определяющий, чей автомобиль (купленный компанией или принятый на комиссию)</Comment>
					<Type>
						<v8:Type>cfg:EnumRef.СтатусыПартий</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Партия</Name>
					<Comment>Партия по которой поступил или был взят на комиссию автомобиль</Comment>
					<Type>
						<v8:TypeSet>cfg:Characteristic.ТипыПартий</v8:TypeSet>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ГТД</Name>
					<Comment>ГТД</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.ГТД</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</AccumulationRegister>
</MetaDataObject>

Enums/Renault_ОбъектДляУстановкиКоличестваПеремещенийВыдач.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.17">
	<Enum>
		<Properties>
			<Name>Renault_ОбъектДляУстановкиКоличестваПеремещенийВыдач</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>ПланПеремещений</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ЖурналВыдачи</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ЖурналОплат</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

InformationRegisters/Renault_ПланПеремещения/Forms/ФормаПланПеремещений/Ext/Form/Module.bsl
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	ТекущийПользователь = ПараметрыСеанса.Пользователь;
	
	Право_РаботаСПланомПеремещений		= ПараметрыСеанса.Renault_ПраваПользователя.РаботатьСПланомПеремещений;
	Право_РедактироватьПланПеремещений	= ПараметрыСеанса.Renault_ПраваПользователя.ИзменятьПланПеремещений;
	
	Гл_НачалоИнтервала				= Дата(1,1,1,9,0,0);
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	Renault_КоличествоПеревозокВыдачВДеньСрезПоследних.Объект,
	|	Renault_КоличествоПеревозокВыдачВДеньСрезПоследних.КоличествоПеремещенийВыдач
	|ИЗ
	|	РегистрСведений.Renault_КоличествоПеревозокВыдачВДень.СрезПоследних(
	|			&Период,
	|			Объект = &Объект
	|				И КоличествоПеремещенийВыдач <> 0
	|				И НЕ ЭтоКоличествоДнейБлокировки) КАК Renault_КоличествоПеревозокВыдачВДеньСрезПоследних";
	Запрос.УстановитьПараметр("Период", ТекущаяДата());
	Запрос.УстановитьПараметр("Объект", Перечисления.Renault_ОбъектДляУстановкиКоличестваПеремещенийВыдач.ПланПеремещений);
	Выборка = Запрос.Выполнить().Выбрать();
	Если Выборка.Следующий() Тогда
		КоличествоПеремещений = Выборка.КоличествоПеремещенийВыдач;
	Иначе
		КоличествоПеремещений = 0;
	КонецЕсли;
	
	Гл_ИнтервалВМинутах = ?(КоличествоПеремещений>0,Цел(10*60/КоличествоПеремещений),60);
	Если КоличествоПеремещений>0 Тогда
		РабочийДеньВСекундах = Гл_ИнтервалВМинутах*КоличествоПеремещений*60;
		Гл_КонецИнтервала = Гл_НачалоИнтервала + РабочийДеньВСекундах-Гл_ИнтервалВМинутах*60;
	Иначе
		Гл_КонецИнтервала = Дата(1,1,1,18,0,0);
	КонецЕсли;
	
	НастройкиБлокировкиЗаписей = Неопределено;
	НастройкиБлокировкиЗаписей = ПолучитьНастройкиБлокировкиЗаписей();
	Если  НастройкиБлокировкиЗаписей <> Неопределено Тогда
	ВремяБлокировкиЗаписей = НастройкиБлокировкиЗаписей["Время"];
	КоличествоДнейБлокировки = НастройкиБлокировкиЗаписей["Количествоперемещений"]; 
	Иначе 
	ВремяБлокировкиЗаписей = Неопределено;
	КонецЕсли;
	Если ВремяБлокировкиЗаписей <> неопределено Тогда
		ДатаБлокировкиЗаписей = Дата(Год(ТекущаяДата()),Месяц(ТекущаяДата()),День(ТекущаяДата()), Час(ВремяБлокировкиЗаписей),Минута(ВремяБлокировкиЗаписей),00);
		Если ТекущаяДата() < ДатаБлокировкиЗаписей Тогда
			Гл_ИнтервалБлокировкиЗаписей = КонецДня(ТекущаяДата()+24*60*60*(КоличествоДнейБлокировки-1))-ТекущаяДата();//заблокировано доконца дня
		Иначе
			Гл_ИнтервалБлокировкиЗаписей = КонецДня(ТекущаяДата()+24*60*60*КоличествоДнейБлокировки)-ТекущаяДата();//заблокировано до конца следующего дня
		КонецЕсли;
	Иначе
		Гл_ИнтервалБлокировкиЗаписей	= 12*3600; //блокируются записи за 12 часов
	КонецЕсли;
	
	ТекстВремени = "
	|ВЫБРАТЬ
	|NULL КАК Часов,
	|NULL КАК Минут";
	
	ИндексВремя = Гл_НачалоИнтервала;
	Пока ИндексВремя <= Гл_КонецИнтервала Цикл
		ТекстВремени	= ТекстВремени + "
		|	ОБЪЕДИНИТЬ ВСЕ
		|	
		|	ВЫБРАТЬ
		|		" + Час(ИндексВремя) + ",
		|		" + Минута(ИндексВремя);
		ИндексВремя	= ИндексВремя + гл_ИнтервалВМинутах * 60;
	КонецЦикла;
	
	ДинамическийСписок.ТекстЗапроса = СтрЗаменить(Гл_ТекстЗапроса, "//ТекстВремени", ТекстВремени);
	
	Пар_ТекущаяДата = НачалоДня(ТекущаяДата());
	Гл_ДатаНедели	= Пар_ТекущаяДата + 86400 *(1 - ДеньНедели(Пар_ТекущаяДата));
	
	ДинамическийСписок.Параметры.УстановитьЗначениеПараметра("ВыводимаяДата",	Пар_ТекущаяДата);
	ДинамическийСписок.Параметры.УстановитьЗначениеПараметра("ТекущаяДата",		ТекущаяДата());
	
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	ОбновлениеДинамическихДанных();
	
	ПодключитьОбработчикОжидания("ОбновлениеДинамическихДанных", 120, Ложь);
	
КонецПроцедуры

//////////////////////////////////////////
//НАЧАЛО	СОБЫТИЯ ЭЛЕМЕНТОВ	  НАЧАЛО//
//////////////////////////////////////////

&НаКлиенте
Процедура КомандаОбновитьСписок(Команда)
	
	ОбновлениеДинамическихДанных();
	
КонецПроцедуры

&НаКлиенте
Процедура ТекущаяДатаПриИзменении(Элемент)
	
	ДинамическийСписок.Параметры.УстановитьЗначениеПараметра("ТекущаяДата", Пар_ТекущаяДата);
	
КонецПроцедуры

//нажатия на дни недели +++

&НаКлиенте
Процедура ДатаДня_Д1Нажатие(Элемент, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	ВыбранДеньНедели(1);
	
КонецПроцедуры

&НаКлиенте
Процедура ДатаДня_Д2Нажатие(Элемент, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	ВыбранДеньНедели(2);
	
КонецПроцедуры

&НаКлиенте
Процедура ДатаДня_Д3Нажатие(Элемент, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	ВыбранДеньНедели(3);
	
КонецПроцедуры

&НаКлиенте
Процедура ДатаДня_Д4Нажатие(Элемент, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	ВыбранДеньНедели(4);
	
КонецПроцедуры

&НаКлиенте
Процедура ДатаДня_Д5Нажатие(Элемент, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	ВыбранДеньНедели(5);
	
КонецПроцедуры

&НаКлиенте
Процедура ДатаДня_Д6Нажатие(Элемент, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	ВыбранДеньНедели(6);
	
КонецПроцедуры

&НаКлиенте
Процедура ДатаДня_Д7Нажатие(Элемент, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	ВыбранДеньНедели(7);
	
КонецПроцедуры

//нажатия на дни недели ---

&НаКлиенте
Процедура КомандаПредыдущаяНеделя(Команда)
	
	Смещение = -7 * 86400;
	
	Гл_ДатаНедели = гл_ДатаНедели + Смещение;
	Пар_ТекущаяДата = Пар_ТекущаяДата + Смещение;
	
	ОбновлениеДинамическихДанных();
	
КонецПроцедуры

&НаКлиенте
Процедура КомандаСледующаяНеделя(Команда)
	
	Смещение = 7 * 86400;
	
	гл_ДатаНедели = Гл_ДатаНедели + Смещение;
	Пар_ТекущаяДата = Пар_ТекущаяДата + Смещение;
	
	ОбновлениеДинамическихДанных();
	
КонецПроцедуры

&НаКлиенте

Процедура ДинамическийСписокВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь; 
	РежимВыбораВремени = Ложь;
	
	Если ЭтаФорма.ВладелецФормы <> Неопределено Тогда
		
		Если ЭтаФорма.ВладелецФормы.ТекущийЭлемент.Имя = "ДинамическийСписок" Тогда
			РежимВыбораВремени = Истина;
		КонецЕсли;
		
	КонецЕсли;
	
	ДанныеСтроки = Элементы.ДинамическийСписок.ДанныеСтроки(ВыбраннаяСтрока);
	
	//добавим возможность планировать в обход времени блокировки записей, в основном нужно для Москвы
	ЕстьПраво_СоздаватьЗаписьВОбходВремениБлокировкиЗаписей = ПараметрыСеанса.Renault_ПраваПользователя.СоздаватьЗаписьВОбходВремениБлокировкиЗаписей;
	Если ДанныеСтроки.Время >= ТекущаяДата() + Гл_ИнтервалБлокировкиЗаписей ИЛИ (ЕстьПраво_СоздаватьЗаписьВОбходВремениБлокировкиЗаписей И ДанныеСтроки.Время >= ТекущаяДата()) Тогда
		
		Если РежимВыбораВремени Тогда
			
			Если ДанныеСтроки.ЭтоЗапись Тогда
				Если ДанныеСтроки.ЗаписьЗаблокирована Тогда
					Сообщить("Нельзя сформировать заявку на это время! Запись заблокирована!!!", СтатусСообщения.ОченьВажное);
				Иначе
					Сообщить("Нельзя сформировать несколько заявок на одно время!!", СтатусСообщения.ОченьВажное);
				КонецЕсли;
				Возврат;
			Иначе 
				Закрыть(Новый Структура("ДатаПеремещения,Ответственный", ДанныеСтроки.Время, ТекущийПользователь));
			КонецЕсли;
			
		Иначе
			
			Если ДанныеСтроки.ЭтоЗапись Тогда//И
				//(ДанныеСтроки.Зарезервировано ИЛИ
				Если ДанныеСтроки.Ответственный <> ТекущийПользователь//)
					И НЕ Право_РедактироватьПланПеремещений Тогда
					Предупреждение("У вас нету права на изменение плана перемещений!", 15);
				ИначеЕсли НЕ Право_РаботаСПланомПеремещений Тогда
					Предупреждение("У вас нету права на работу с планом перемещений!", 15);
				ИначеЕсли ДанныеСтроки.ЗаписьЗаблокирована Тогда
					Предупреждение("Нельзя сформировать заявку на это время! Запись заблокирована!!!", 15);
				Иначе
					ПараметрыОткрытия = Новый Структура("ДатаПлан,Заявка", ДанныеСтроки.Время, ДанныеСтроки.ЗаявкаНаПеремещение);
					ОткрытьФормуМодально("РегистрСведений.Renault_ПланПеремещения.Форма.ФормаЗаписи", ПараметрыОткрытия);
					ОбновлениеДинамическихДанных();
				КонецЕсли;
				
			Иначе
				
				ДатаПоступления = Формат(Дата(Год(ДанныеСтроки.Время), Месяц(ДанныеСтроки.Время), День(ДанныеСтроки.Время)));
				ВремяПоступления = Дата(1,1,1, Час(ДанныеСтроки.Время), Минута(ДанныеСтроки.Время), Секунда(ДанныеСтроки.Время));
				ПараметрыОткрытия = Новый Структура("ЖелаемаяДатаПеремещения,ВремяПоступления, Продавец", ДатаПоступления, ВремяПоступления, ТекущийПользователь);
				Форма = ПолучитьФорму("Документ.Renault_ПотребностьПеремещения.Форма.ФормаДокумента");
				Форма.ЖелаемаяДатаПеремещения = ДатаПоступления;
				Форма.ВремяПоступления = ВремяПоступления;
				Форма.Открыть();
				
			КонецЕсли;
			
		КонецЕсли;
		
	Иначе
		
		Если ДанныеСтроки.ЭтоЗапись Тогда
			
			ПараметрыОткрытия = Новый Структура("ДатаПлан,Заявка", ДанныеСтроки.Время, ДанныеСтроки.ЗаявкаНаПеремещение);
			ОткрытьФормуМодально("РегистрСведений.Renault_ПланПеремещения.Форма.ФормаЗаписи", ПараметрыОткрытия);
			ОбновлениеДинамическихДанных();
			
		Иначе
			
			Предупреждение("Данные запрещены для изменения!", 15);
			
		КонецЕсли;
		
	КонецЕсли;
	
КонецПроцедуры

//////////////////////////////////////////
//КОНЕЦ		СОБЫТИЯ ЭЛЕМЕНТОВ	   КОНЕЦ//
//////////////////////////////////////////

//////////////////////////////////////////
//самописные процедуры и функции
//------------------BEGIN-----------------
//общая процедура отработки нажатия на выбор даты недели
&НаКлиенте
Процедура ВыбранДеньНедели(НомерДня)
	
	Пар_ТекущаяДата = Гл_ДатаНедели + (НомерДня - 1) * 86400;
	ОбновлениеДинамическихДанных();
	
КонецПроцедуры

//процедуры по работе с динамическими данными +++
&НаКлиенте
Функция ПолучитьТекстДняНедели(НомерДня)
	
	Если НомерДня = 1 Тогда
		Возврат "Понедельник";
	ИначеЕсли НомерДня = 2 Тогда
		Возврат "Вторник";
	ИначеЕсли НомерДня = 3 Тогда
		Возврат "Среда";
	ИначеЕсли НомерДня = 4 Тогда
		Возврат "Четверг";
	ИначеЕсли НомерДня = 5 Тогда
		Возврат "Пятница";
	ИначеЕсли НомерДня = 6 Тогда
		Возврат "Суббота";
	Иначе
		Возврат "Воскресенье";
	КонецЕсли;
	
КонецФункции

&НаКлиенте
Процедура СформироватьНадписиДней()
	
	текДеньНедели = ДеньНедели(Пар_ТекущаяДата);
	
	Для текДН = 1 ПО 7 Цикл
		
		ИмяЭлементаДата		= "ДатаДня_Д" + текДН;
		текДата				= Гл_ДатаНедели + 86400 *(ДеньНедели(Гл_ДатаНедели) + текДН - 2);
		//значение даты
		ЭтаФорма[ИмяЭлементаДата] = текДата;
		
		//настройки элемента даты
		Если текДН = текДеньНедели Тогда
			Элементы[ИмяЭлементаДата].ЦветТекста	= Новый Цвет;
			Элементы[ИмяЭлементаДата].ЦветФона		= WebЦвета.ЗеленоватоЛимонный;
		Иначе 
			Элементы[ИмяЭлементаДата].ЦветТекста	= WebЦвета.Черный;
			Элементы[ИмяЭлементаДата].ЦветФона		= Новый Цвет;
		КонецЕсли;
		//элемент количество записей на эту дату
		ИмяЭлементаЗаписи		= "Декорация_Записи_Д" + текДН;
		ИмяЭлементаИндикатор    = "ИндикаторЗаполненности_Д" + текДН;
		
		//найдем количество записей
		поискСтроки = Гл_ТаблицаКоличествоЗаписей.НайтиСтроки(Новый Структура("Дата", текДата));
		КолФакт = 0;
		КолПлан = 0;
		
		Если поискСтроки.Количество() Тогда
			КолФакт = поискСтроки[0].КоличествоФакт;
			КолПлан = поискСтроки[0].КоличествоПлан;
		КонецЕсли;
		
		//изменим текст заголовка количествая записи
		Элементы[ИмяЭлементаЗаписи].Заголовок = Строка(КолФакт) + "/" + Строка(КолПлан);
		//теперь изменим индикатор
		Элементы[ИмяЭлементаИндикатор].МаксимальноеЗначение = КолПлан;
		ЭтаФорма[ИмяЭлементаИндикатор]						= КолФакт;
		
	КонецЦикла;
	
КонецПроцедуры

&НаКлиенте
Процедура ОбновлениеДинамическихДанных()
	
	ЗаполнитьРасписаниеПеремещений();
	ЗаполнитьТаблицуКоличествоЗаписей();
	
	СформироватьНадписиДней();
	
	текДата = ТекущаяДата();
	
	ПараметрыДинСписка = ДинамическийСписок.Параметры;
	
	ПараметрыДинСписка.УстановитьЗначениеПараметра("ВыводимаяДата",			Пар_ТекущаяДата);
	ПараметрыДинСписка.УстановитьЗначениеПараметра("ТекущаяДата",			текДата);
	ПараметрыДинСписка.УстановитьЗначениеПараметра("ДатаЗапретаИзменения",	текДата + Гл_ИнтервалБлокировкиЗаписей);
	Элементы.ДинамическийСписок.Обновить();
	
КонецПроцедуры

&НаКлиенте
Процедура ЗаполнитьРасписаниеПеремещений()
	
	Гл_НачалоИнтервала = Дата(1,1,1,9,0,0);
	КоличествоПеремещений = 0;
	ВремяБлокировкиЗаписей = Неопределено;
	ПолучитьКоличествоПеремещенийВремяБлокировки(КоличествоПеремещений, ВремяБлокировкиЗаписей, Пар_ТекущаяДата);
	
	Гл_ИнтервалВМинутах = ?(КоличествоПеремещений > 0, Цел(10*60/КоличествоПеремещений), 60);
	Если КоличествоПеремещений > 0 Тогда
		РабочийДеньВСекундах = Гл_ИнтервалВМинутах * КоличествоПеремещений * 60;
		Гл_КонецИнтервала = Гл_НачалоИнтервала + РабочийДеньВСекундах - Гл_ИнтервалВМинутах * 60;
	Иначе
		Гл_КонецИнтервала = Дата(1,1,1,18,0,0);
	КонецЕсли;
	
	НастройкиБлокировкиЗаписей = Неопределено;
	НастройкиБлокировкиЗаписей = ПолучитьНастройкиБлокировкиЗаписей();
	Если НастройкиБлокировкиЗаписей <> Неопределено Тогда
		ВремяБлокировкиЗаписей = НастройкиБлокировкиЗаписей["Время"];
		КоличествоДнейБлокировки = НастройкиБлокировкиЗаписей["Количествоперемещений"]; 
	Иначе 
		ВремяБлокировкиЗаписей = Неопределено;
	КонецЕсли;
	Если ВремяБлокировкиЗаписей <> неопределено Тогда
		ДатаБлокировкиЗаписей = Дата(Год(ТекущаяДата()), Месяц(ТекущаяДата()), День(ТекущаяДата()), Час(ВремяБлокировкиЗаписей), Минута(ВремяБлокировкиЗаписей), 00);
		Если ТекущаяДата()< ДатаБлокировкиЗаписей Тогда
			Гл_ИнтервалБлокировкиЗаписей = КонецДня(ТекущаяДата()+24*60*60*(КоличествоДнейБлокировки-1))-ТекущаяДата();//заблокировано доконца дня
		Иначе
			Гл_ИнтервалБлокировкиЗаписей = КонецДня(ТекущаяДата()+24*60*60*КоличествоДнейБлокировки)-ТекущаяДата();//заблокировано до конца следующего дня
		КонецЕсли;
	Иначе
		Гл_ИнтервалБлокировкиЗаписей = 12*3600; //блокируются записи за 12 часов
	КонецЕсли;
	
	ТекстВремени = "
	|ВЫБРАТЬ
	|NULL КАК Часов,
	|NULL КАК Минут";
	
	ИндексВремя = Гл_НачалоИнтервала;
	Пока ИндексВремя <= Гл_КонецИнтервала Цикл
		ТекстВремени = ТекстВремени + "
		|	ОБЪЕДИНИТЬ ВСЕ
		|	
		|	ВЫБРАТЬ
		|		" + Час(ИндексВремя) + ",
		|		" + Минута(ИндексВремя);
		ИндексВремя = ИндексВремя + гл_ИнтервалВМинутах * 60;
	КонецЦикла;
	
	ДинамическийСписокИзменитьТекстЗапроса(Гл_ТекстЗапроса, ТекстВремени);
	
КонецПроцедуры

&НаСервере
Процедура ДинамическийСписокИзменитьТекстЗапроса(Гл_ТекстЗапроса, ТекстВремени)
	
	ДинамическийСписок.ТекстЗапроса = СтрЗаменить(Гл_ТекстЗапроса, "//ТекстВремени", ТекстВремени);
	
КонецПроцедуры

&НаСервереБезКонтекста
Процедура ПолучитьКоличествоПеремещенийВремяБлокировки(КоличествоПеремещений, ВремяБлокировкиЗаписей, Пар_ТекущаяДата)
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	Renault_КоличествоПеревозокВыдачВДеньСрезПоследних.Объект,
	|	Renault_КоличествоПеревозокВыдачВДеньСрезПоследних.КоличествоПеремещенийВыдач
	|ИЗ
	|	РегистрСведений.Renault_КоличествоПеревозокВыдачВДень.СрезПоследних(
	|			&Период,
	|			Объект = &Объект
	|				И ЭтоКоличествоДнейБлокировки = ЛОЖЬ
	|				И КоличествоПеремещенийВыдач <> 0) КАК Renault_КоличествоПеревозокВыдачВДеньСрезПоследних";
	Запрос.УстановитьПараметр("Период", Пар_ТекущаяДата);
	Запрос.УстановитьПараметр("Объект", Перечисления.Renault_ОбъектДляУстановкиКоличестваПеремещенийВыдач.ПланПеремещений);
	Выборка = Запрос.Выполнить().Выбрать();
	Если Выборка.Следующий() Тогда
		КоличествоПеремещений = Выборка.КоличествоПеремещенийВыдач;
	Иначе
		КоличествоПеремещений = 0;
	КонецЕсли;
	
	ВремяБлокировкиЗаписей = Константы.Renault_ВремяБлокировкиЗаписейПланПеремещений.Получить();
	
КонецПроцедуры // ПолучитьКоличествоПеремещенийВремяБлокировки()

&НаКлиенте
Процедура ЗаполнитьТаблицуКоличествоЗаписей()
	
	ДатаКонецНедели = Гл_ДатаНедели + 6 * 86400;
	ВсегоИнтервалов = (Гл_КонецИнтервала - Гл_НачалоИнтервала) / (Гл_ИнтервалВМинутах * 60) + 1;
	
	ФактТаблицаЗаписей = ПолучитьКоличествоЗаписейЗаПериод(Гл_ДатаНедели, ДатаКонецНедели, ВсегоИнтервалов);
	
	МоментПоиска = Строка(Новый УникальныйИдентификатор);
	СтарыйМоментПоиска = ?(Гл_ТаблицаКоличествоЗаписей.Количество(), Гл_ТаблицаКоличествоЗаписей[0].МоментПоиска, Неопределено);
	
	Гл_НадоОбновитьНадписи	= Ложь;
	
	//заполним таблицу по количеству записей по датам
	Для каждого текСтрока из ФактТаблицаЗаписей Цикл
		//если таблица пустая, то просто заполним
		Если СтарыйМоментПоиска = Неопределено Тогда
			СтрокаЗаписи	= Гл_ТаблицаКоличествоЗаписей.Добавить();
			Гл_НадоОбновитьНадписи = Истина;
		Иначе
			//попробуем найти эту запись, если она есть, то просто изменем момент поиска
			поискСтроки = Гл_ТаблицаКоличествоЗаписей.НайтиСтроки(Новый Структура("Дата,КоличествоФакт,КоличествоПлан", текСтрока.Дата, текСтрока.КоличествоФакт, текСтрока.КоличествоПлан));
			Если поискСтроки.Количество() Тогда
				СтрокаЗаписи = поискСтроки[0];
			Иначе
				//если не нашли, то добавим новую запись
				СтрокаЗаписи = Гл_ТаблицаКоличествоЗаписей.Добавить();
				//поставим флаг, что надо будет обновить надписи
				Гл_НадоОбновитьНадписи = Истина;
			КонецЕсли;
		КонецЕсли;
		ЗаполнитьЗначенияСвойств(СтрокаЗаписи, текСтрока);
		СтрокаЗаписи.МоментПоиска	= МоментПоиска;
	КонецЦикла;
	//теперь удалим старые записи, это чтобы таблица не пухла
	поискСтарыхЗаписей = Гл_ТаблицаКоличествоЗаписей.НайтиСтроки(Новый Структура("МоментПоиска", СтарыйМоментПоиска));
	Для каждого текСтрока ИЗ поискСтарыхЗаписей Цикл
		Гл_ТаблицаКоличествоЗаписей.Удалить(текСтрока);
	КонецЦикла;
	
КонецПроцедуры

&НаСервереБезКонтекста
Функция ПолучитьКоличествоЗаписейЗаПериод(ДатаНачало,ДатаКонец, ВсегоИнтервалов)
	
	ТаблицаДат = Новый ТаблицаЗначений;
	ТаблицаДат.Колонки.Добавить("ДатаПлан", Новый ОписаниеТипов("Дата"));
	
	текДата = ДатаНачало;
	Пока текДата <= ДатаКонец Цикл
		ЗаполнитьЗначенияСвойств(ТаблицаДат.Добавить(), Новый Структура("ДатаПлан", текДата));
		текДата = текДата + 86400;
	КонецЦикла;
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	ТаблицаДат.ДатаПлан КАК ДатаЗаписи
	|ПОМЕСТИТЬ ВТ_ТаблицаДат
	|ИЗ
	|	&ТаблицаДат КАК ТаблицаДат
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВТ_ТаблицаДат.ДатаЗаписи КАК Дата,
	|	ЕСТЬNULL(ВЗ_ПланПеремещений.КоличествоФакт, 0) КАК КоличествоФакт,
	|	&ВсегоИнтервалов КАК КоличествоПлан
	|ИЗ
	|	ВТ_ТаблицаДат КАК ВТ_ТаблицаДат
	|		ЛЕВОЕ СОЕДИНЕНИЕ (ВЫБРАТЬ
	|			НАЧАЛОПЕРИОДА(ПланПеремещений.ДатаПлан, ДЕНЬ) КАК ДатаПлан,
	|			КОЛИЧЕСТВО(ПланПеремещений.ДатаПлан) КАК КоличествоФакт
	|		ИЗ
	|			РегистрСведений.Renault_ПланПеремещения КАК ПланПеремещений
	|		ГДЕ
	|			ПланПеремещений.ДатаПлан >= НАЧАЛОПЕРИОДА(&ДатаНачало,ДЕНЬ)
	|			И ПланПеремещений.ДатаПлан <= КОНЕЦПЕРИОДА(&ДатаКонец,ДЕНЬ)
	|			И (ПланПеремещений.Автомобиль <> ЗНАЧЕНИЕ(Справочник.Автомобили.ПустаяСсылка)
	|					ИЛИ ПланПеремещений.Зарезервировано = ИСТИНА
	|					ИЛИ ПланПеремещений.ЗаписьЗаблокирована = ИСТИНА)
	|		
	|		СГРУППИРОВАТЬ ПО
	|			НАЧАЛОПЕРИОДА(ПланПеремещений.ДатаПлан, ДЕНЬ)) КАК ВЗ_ПланПеремещений
	|		ПО ВЗ_ПланПеремещений.ДатаПлан = ВТ_ТаблицаДат.ДатаЗаписи";
	
	Запрос.УстановитьПараметр("ТаблицаДат", 		ТаблицаДат);
	Запрос.УстановитьПараметр("ДатаНачало",			ДатаНачало);
	Запрос.УстановитьПараметр("ДатаКонец",			ДатаКонец);
	Запрос.УстановитьПараметр("ТекущаяДата",		ТекущаяДата());
	Запрос.УстановитьПараметр("ВсегоИнтервалов",	ВсегоИнтервалов);
	
	Результат = Запрос.Выполнить().Выгрузить();
	
	Возврат Renault_ОбщегоНазначенияКлиентСервер.ПолучитьМассивСтруктурИзТаблицы(Результат, "Дата,КоличествоФакт,КоличествоПлан");
	
КонецФункции

&НаКлиенте
Процедура КомандаСоздатьПеремещения(Команда)
	
	Результат = СоздатьПеремещения();
	
	Если Результат.Количество() Тогда
		
		Форма = ПолучитьФорму("РегистрСведений.Renault_ПланПеремещения.Форма.ФормаСозданияПеремещений");
		
		Маршруты = Результат.Скопировать();
		Маршруты.Свернуть("СкладОтправитель, СкладПолучатель");
		Сч = 1;
		Для Каждого Строка Из Маршруты Цикл
			НоваяСтрока = Форма.Маршруты.Добавить();
			НоваяСтрока.Идентификатор = Сч;
			НоваяСтрока.Отправитель = Строка.СкладОтправитель;
			НоваяСтрока.Получатель = Строка.СкладПолучатель;
			НайденныеСтроки = Результат.НайтиСтроки(Новый Структура("СкладОтправитель, СкладПолучатель", Строка.СкладОтправитель, Строка.СкладПолучатель));
			Для Каждого Строка Из НайденныеСтроки Цикл
				НоваяСтрока = Форма.Перемещения1.Добавить();
				НоваяСтрока.Идентификатор = Сч;
				НоваяСтрока.Время = Строка.ДатаПлан;
				НоваяСтрока.Автомобиль = Строка.Автомобиль;
				НоваяСтрока.Заявка= Строка.ПотребностьПеремещения;
				НоваяСтрока.ВнутреннийНомер= Строка.ВнутреннийНомер;
			КонецЦикла;
			Сч = Сч + 1;
		КонецЦикла;
		
		Форма.Открыть();
		
	Иначе
		
		Сообщить("На текущий день перемещения не запланированы или документы перемещения уже созданы");
		
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Функция СоздатьПеремещения()
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	ПланПеремещений.Автомобиль,
	|	ПланПеремещений.ДатаПлан,
	|	ПланПеремещений.СкладОтправитель,
	|	ПланПеремещений.СкладПолучатель,
	|	ПланПеремещений.ПотребностьПеремещения,
	|	Renault_РазмещениеАвтомобилей.Место КАК ВнутреннийНомер
	|ИЗ
	|	РегистрСведений.Renault_ПланПеремещения КАК ПланПеремещений
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.Renault_РазмещениеАвтомобилей КАК Renault_РазмещениеАвтомобилей
	|		ПО ПланПеремещений.Автомобиль = Renault_РазмещениеАвтомобилей.Автомобиль
	|ГДЕ
	|	ПланПеремещений.ДатаПлан МЕЖДУ &НачПериода И &КонПериода
	|	И НЕ ПланПеремещений.Перемещено
	|	И ПланПеремещений.ДокументПеремещения = ЗНАЧЕНИЕ(Документ.ПеремещениеАвтомобилей.ПустаяСсылка)";
	
	Запрос.УстановитьПараметр("НачПериода", НачалоДня(Пар_ТекущаяДата));
	Запрос.УстановитьПараметр("КонПериода", КонецДня(Пар_ТекущаяДата));
	
	Результат = Запрос.Выполнить().Выгрузить();
	
	Возврат Результат;
	
КонецФункции

&НаКлиенте
Процедура КомандаПеренестиЗаявкуНаПеремещение(Команда)
	
	ТекСтрока = ЭтаФорма.Элементы.ДинамическийСписок.ТекущиеДанные;
	Если ТекСтрока = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	Если ТекСтрока.СозданДокументПеремещения Тогда
		Сообщить("По данной заявке уже сформирован документ перемещения!",СтатусСообщения.ОченьВажное);
		Возврат;
	КонецЕсли;
	
	ЕстьПравоНаПереносЗаявки = ПараметрыСеанса.Renault_ПраваПользователя.ПереносЧужихЗаявокНаПеремещение;
	ЕстьРасширенныеПраваНаПереносЗаявки = ПараметрыСеанса.Renault_ПраваПользователя.ПереносЧужихЗаявокНаПеремещениеРасширенныеПрава;
	
	Если ТекСтрока.Время <= КонецДня(ТекущаяДата()+24*60*60) Тогда
		Если НЕ ЕстьРасширенныеПраваНаПереносЗаявки Тогда
			Сообщить("Нет прав на перенос данной заявки!!!", СтатусСообщения.Важное);
			ВОзврат;
		КонецЕсли;
	Иначе
		Если ТекСтрока.Ответственный <> ТекущийПользователь И Не ЕстьПравоНаПереносЗаявки И НЕ ЕстьРасширенныеПраваНаПереносЗаявки Тогда
			Сообщить("Нет прав на перенос данной заявки!!!", СтатусСообщения.Важное);
			Возврат;
		КонецЕсли;
	КонецЕсли;
	
	НовоеВремяЗаписи = ВыбратьВремяИзПланаПеремещений(ТекСтрока);
	Если НовоеВремяЗаписи = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	Если ЗначениеЗаполнено(ТекСтрока.ЗаявкаНаПеремещение) Тогда
		ЗаявкаОбъект = ТекСтрока.ЗаявкаНаПеремещение.ПолучитьОбъект();
		ЗаявкаОбъект.ПеренестиЗаявку(ТекСтрока, НовоеВремяЗаписи);
	Иначе
		Сообщить("Заявка не зарегистрировна!");
	КонецЕсли;
	
	ОбновлениеДинамическихДанных();
	
КонецПроцедуры

&НаСервереБезКонтекста
Функция ПолучитьПраваПользователя(ТекущийПользователь, Настройка)
	
	ЕстьПравоНаПереносЗаявки = РегистрыСведений.ЗначениеНастроекПользователя.Получить(Новый Структура("Пользователь, Настройка", ТекущийПользователь, Настройка));
	Возврат ЕстьПравоНаПереносЗаявки;
	
КонецФункции

&НаКлиенте
Функция ВыбратьВремяИзПланаПеремещений(ТекСтрока)
	
	ФормаПланаПеремещений = РегистрыСведений.Renault_ПланПеремещения.ПолучитьФорму("ФормаПланПеремещений");
	ФормаПланаПеремещений.ВладелецФормы = ЭтаФорма;
	СтруктураВремяВстречиПлан = ФормаПланаПеремещений.ОткрытьМодально();
	
	Если СтруктураВремяВстречиПлан <> Неопределено Тогда
		
		ДатаВремяПеремещения = СтруктураВремяВстречиПлан.ДатаПеремещения;
		Ответственный = ТекущийПользователь;
		Возврат Новый Структура("ДатаВремяПеремещения, Ответственный", ДатаВремяПеремещения, Ответственный);
		
	Иначе
		
		Возврат Неопределено;
		
	КонецЕсли;
	
КонецФункции // ВыбратьВремяИзПланаПеремещений()

&НаСервере
Функция ПолучитьНастройкиБлокировкиЗаписей()
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	Renault_КоличествоПеревозокВыдачВДеньСрезПоследних.КоличествоПеремещенийВыдач,
	|	Renault_КоличествоПеревозокВыдачВДеньСрезПоследних.Дата
	|ИЗ
	|	РегистрСведений.Renault_КоличествоПеревозокВыдачВДень.СрезПоследних(
	|			&Период,
	|			Объект = &Объект
	|				И ЭтоКоличествоДнейБлокировки = ИСТИНА) КАК Renault_КоличествоПеревозокВыдачВДеньСрезПоследних";
	Запрос.УстановитьПараметр("Период", ТекущаяДата());
	Запрос.УстановитьПараметр("Объект", Перечисления.Renault_ОбъектДляУстановкиКоличестваПеремещенийВыдач.ПланПеремещений);
	
	Выборка = Запрос.Выполнить().Выбрать();
	Если Выборка.Следующий() Тогда
		НастройкиБлокировкиЗаписей = Новый Структура;
		НастройкиБлокировкиЗаписей.Вставить("Время", Выборка.Дата);
		НастройкиБлокировкиЗаписей.Вставить("Количествоперемещений", Выборка.КоличествоПеремещенийВыдач);
		Возврат НастройкиБлокировкиЗаписей;
	КонецЕсли;
	
КонецФункции

&НаКлиенте
Процедура КомандаОтчетПланПеремещений(Команда)
	
	Форма = ПолучитьФорму("Отчет.Renault_ПланПеремещений.Форма.ФормаОтчета");
	Форма.Открыть();
	
КонецПроцедуры

&НаКлиенте
Процедура КомандаЗаблокироватьЗапись(Команда)
	
	//сначала проверяем, нет ли заявки на это время
	//если есть заявка - то в любом случае блокировать нельзя
	//проверяем наличие прав
	ЕстьПравоНаБлокированиеЗаписи = ПараметрыСеанса.Renault_ПраваПользователя.БлокированиеЗаписейВПланеПеремещений;
	Если НЕ ЕстьПравоНаБлокированиеЗаписи Тогда
		Сообщить("Нет прав на блокирование записей в плане перемещений!!!", СтатусСообщения.Важное);
		Возврат;
	КонецЕсли;
	
	Для Каждого Строка ИЗ ЭтаФорма.Элементы.ДинамическийСписок.ВыделенныеСтроки Цикл
		ДанныеСтроки = ЭтаФорма.Элементы.ДинамическийСписок.ДанныеСтроки(Строка);
	Если ДанныеСтроки.ЭтоЗапись Тогда
		Если НЕ ЭтаФорма.Элементы.ДинамическийСписок.ТекущиеДанные.ЗаписьЗаблокирована Тогда
			Сообщить("На это время запланировано перемещение. Нельзя заблокировать запись!", СтатусСообщения.Важное);
		Иначе
			Сообщить("Эта запись уже заблокирована!!!", СтатусСообщения.Важное);
		КонецЕсли;
		Возврат;
	КонецЕсли;
	НоваяЗаписьВРегистр                     = РегистрыСведений.Renault_ПланПеремещения.СоздатьМенеджерЗаписи();
	НоваяЗаписьВРегистр.ДатаПлан            = ДанныеСтроки.Время;
	НоваяЗаписьВРегистр.ЗаписьЗаблокирована = Истина;
	НоваяЗаписьВРегистр.Записать();
	КонецЦикла;
	
	ОбновлениеДинамическихДанных();
	
КонецПроцедуры

&НаКлиенте
Процедура КомандаРазблокироватьЗапись(Команда)
	
	//проверяем наличие прав
	ЕстьПравоНаБлокированиеЗаписи = ПараметрыСеанса.Renault_ПраваПользователя.БлокированиеЗаписейВПланеПеремещений;
	Если НЕ ЕстьПравоНаБлокированиеЗаписи Тогда
		Сообщить("Нет прав на блокирование записей в плане перемещений!!!", СтатусСообщения.Важное);
		Возврат;
	КонецЕсли;
	
	Для Каждого Строка из  ЭтаФорма.Элементы.ДинамическийСписок.ВыделенныеСтроки Цикл
		ДанныеСтроки = ЭтаФорма.Элементы.ДинамическийСписок.ДанныеСтроки(Строка);
		Если НЕ ДанныеСтроки.ЭтоЗапись Или НЕ ДанныеСтроки.ЗаписьЗаблокирована Тогда
			Сообщить("Запись не заблокирована!!!", СтатусСообщения.Важное);
			Возврат;
		КонецЕсли;
		ЗаписьДляУдаления                     = РегистрыСведений.Renault_ПланПеремещения.СоздатьМенеджерЗаписи();
		ЗаписьДляУдаления.ДатаПлан            = ДанныеСтроки.Время;
		ЗаписьДляУдаления.ЗаписьЗаблокирована = Истина;
		ЗаписьДляУдаления.Прочитать();
		ЗаписьДляУдаления.Удалить();
	КонецЦикла;
	
	ОбновлениеДинамическихДанных();
	
КонецПроцедуры

// Откроем форму документа Заявки на перемещение для изменения комментария
&НаКлиенте
Процедура КомандаОткрытьЗаявку(Команда)
	
	ТекСтрока = ЭтаФорма.Элементы.ДинамическийСписок.ТекущиеДанные;
	Если ЗначениеЗаполнено(ТекСтрока.ЗаявкаНаПеремещение) Тогда
		ТекСтрока.ЗаявкаНаПеремещение.ПолучитьФорму().Открыть();
	Иначе
		Сообщить("Заявка не зарегистрирована!");
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура СоздатьЗаявкуНаВыдачу(Команда)
	
	ТекСтрока = ЭтаФорма.Элементы.ДинамическийСписок.ТекущиеДанные;
	Право_РаботатьСЖурналомВыдачи = ПараметрыСеанса.Renault_ПраваПользователя.РаботатьСЖурналомВыдачи;
	РабочийЛист = ПроверитьРезеревАвтомобиляПоКонтрагенту(ТекСтрока);
	
	Если РабочийЛист <> Неопределено Тогда
		
		Если Право_РаботатьСЖурналомВыдачи Тогда
		
			ВыбранныйАвтомобиль = ДиалогВыбораАвтомобиляДляВыдачи(РабочийЛист, ТекСтрока.Автомобиль);
			
			Если ЗначениеЗаполнено(ВыбранныйАвтомобиль) И НЕ ВыбранныйАвтомобиль.Автомобиль.Пустая() Тогда
				
				Если ПроверитьВыдачиАвтомобиля(ВыбранныйАвтомобиль)= Истина Тогда
					Возврат;
				КонецЕсли;
				
				ВыбранноеВремя = ДиалогВыбораВремениВыдачиАвтомобиля(ВыбранныйАвтомобиль.Территория);
				
				Если ВыбранноеВремя <> Неопределено И ТипЗнч(ВыбранноеВремя) = Тип("Структура") Тогда
					
					ДанныеЗаписи = Новый Структура;
					ДанныеЗаписи.Вставить("Территория", 	Неопределено);
					ДанныеЗаписи.Вставить("ДатаВыдачи",		Неопределено);
					ДанныеЗаписи.Вставить("РабочийЛист",	РабочийЛист);
					ДанныеЗаписи.Вставить("Автомобиль",		ВыбранныйАвтомобиль.Автомобиль);
					
					ВыбранноеВремя.Свойство("Территория",	ДанныеЗаписи.Территория);
					ВыбранноеВремя.Свойство("ДатаВыдачи",	ДанныеЗаписи.ДатаВыдачи);
					
					Если ЗначениеЗаполнено(ДанныеЗаписи.Территория) И ЗначениеЗаполнено(ДанныеЗаписи.ДатаВыдачи) Тогда
						
						ОткрытьФормуМодально("РегистрСведений.ЖурналВыдачи.Форма.ФормаЗаписи", ДанныеЗаписи);
						
					КонецЕсли;
					
				КонецЕсли;
				
			КонецЕсли;
			
		Иначе
			
			Renault_ОбщегоНазначенияКлиентСервер.СообщитьПользователю("У Вас нет прав на работу с журналом выдачи");
			
		КонецЕсли;
		
	Иначе
		
		Renault_ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Данный автомобиль не зарезервирован для указанного контрагента!");
		
	КонецЕсли;
	
 КонецПроцедуры

&НаСервере
Функция ПроверитьРезеревАвтомобиляПоКонтрагенту(ТекСтрока) 
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	АвтомобилиВРезервеОстатки.Автомобиль,
	|	АвтомобилиВРезервеОстатки.ДокументРезерва,
	|	АвтомобилиВРезервеОстатки.Контрагент,
	|	АвтомобилиВРезервеОстатки.Территория,
	|	АвтомобилиВРезервеОстатки.РабочийЛист
	|ИЗ
	|	РегистрНакопления.Renault_АвтомобилиВРезерве.Остатки КАК АвтомобилиВРезервеОстатки
	|ГДЕ
	|	АвтомобилиВРезервеОстатки.Автомобиль = &Автомобиль
	|	И АвтомобилиВРезервеОстатки.Контрагент = &Контрагент";
	Запрос.УстановитьПараметр("Автомобиль", ТекСтрока.Автомобиль);
	Запрос.УстановитьПараметр("Контрагент", ТекСтрока.Контрагент);
	Результат = Запрос.Выполнить();
	Если Не Результат.Пустой() Тогда
		Выборка = Результат.Выбрать();
		Выборка.Следующий();
		Возврат Выборка.РабочийЛист;
	Иначе
		Возврат Неопределено;
	КонецЕсли;
	
КонецФункции

&НаКлиенте
Функция ДиалогВыбораАвтомобиляДляВыдачи(РабочийЛист, Автомобиль)
	
	ПараметрыОткрытия = Новый Структура;
	
	ПараметрыОткрытия.Вставить("ТекстЗапроса",
	"ВЫБРАТЬ
	|	Renault_Территории.Ссылка КАК Территория,
	|	АвтомобилиВРезервеОстатки.Автомобиль,
	|	АвтомобилиВРезервеОстатки.Территория КАК ТекущаяТерритория
	|ИЗ
	|	РегистрНакопления.Renault_АвтомобилиВРезерве.Остатки(
	|			,
	|			РабочийЛист = &РабочийЛист
	|				И РабочийЛист <> ЗНАЧЕНИЕ(Документ.РабочийЛист.ПустаяСсылка)
	|				И Автомобиль = &Автомобиль) КАК АвтомобилиВРезервеОстатки
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.Renault_Территории КАК Renault_Территории
	|		ПО (ИСТИНА)");
	
	ПолеВыбора = Новый Массив;
	ПолеВыбора.Добавить("Автомобиль");
	ПолеВыбора.Добавить("Территория");
	ПолеВыбора.Добавить("ТекущаяТерритория");
	ПараметрыОткрытия.Вставить("ПолеВыбора", ПолеВыбора);
	
	ПараметрыЗапроса = Новый Структура;
	ПараметрыЗапроса.Вставить("РабочийЛист", РабочийЛист);
	ПараметрыЗапроса.Вставить("Автомобиль", Автомобиль);
	
	ПараметрыОткрытия.Вставить("ПараметрыЗапроса", ПараметрыЗапроса);
	ПараметрыОткрытия.Вставить("ЗаголовокФормы", "Укажите автомобиль и территорию для выдачи");
	
	Возврат ОткрытьФормуМодально("ОбщаяФорма.СтатическаяФормаВыбора", ПараметрыОткрытия);
	
КонецФункции

&НаСервере
Функция ПроверитьВыдачиАвтомобиля(Автомобиль)
	
	Отказ = Ложь;
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	//Исправить
	"ВЫБРАТЬ
	|	ЖурналВыдачи.Автомобиль,
	|	ЖурналВыдачи.ДатаВыдачи,
	|	ЖурналВыдачи.Территория
	|ИЗ
	|	РегистрСведений.ЖурналВыдачи КАК ЖурналВыдачи
	|ГДЕ
	|	НЕ ЖурналВыдачи.Выдан
	|	И ЖурналВыдачи.Автомобиль = &Автомобиль";
	Запрос.УстановитьПараметр("Автомобиль", Автомобиль.Автомобиль);
	Результат = Запрос.Выполнить();
	Если НЕ Результат.Пустой() Тогда
		Отказ = Истина;
		Выборка = Результат.Выбрать();
		Выборка.Следующий();
		Renault_ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Выдача данного автомобиля уже запланирована на " + Выборка.ДатаВыдачи + ". Территория - " + Выборка.Территория + ".");
	КонецЕсли;
	
	Возврат Отказ;
	
КонецФункции

&НаКлиенте
Функция ДиалогВыбораВремениВыдачиАвтомобиля(ТекущаяТерритория)
	
	ПараметрыОткрытия = Новый Структура;
	
	ПараметрыОткрытия.Вставить("РежимВыбора", Истина);
	
	ДанныеЗаполнения = Новый Структура;
	ДанныеЗаполнения.Вставить("Территория", ТекущаяТерритория);
	
	ПараметрыОткрытия.Вставить("ДанныеЗаполнения", ДанныеЗаполнения);
	
	Возврат ОткрытьФормуМодально("РегистрСведений.ЖурналВыдачи.Форма.ФормаЖурналВыдачи", ПараметрыОткрытия);
	
КонецФункции

//процедуры по работе с динамическими данными ---

//------------------END-------------------
////самописные процедуры и функции
//////////////////////////////////////////

гл_ТекстЗапроса = 
"ВЫБРАТЬ
|             ЕСТЬNULL(ВЗ_ПустыеЗаписи.ДатаВремя, ВЗ_ПланПеремещений.ДатаПлан) КАК Время,
|             ЕСТЬNULL(ВЗ_ПланПеремещений.Автомобиль, ЗНАЧЕНИЕ(Справочник.Автомобили.ПустаяСсылка)) КАК Автомобиль,
|             ЕСТЬNULL(ВЗ_ПланПеремещений.Контрагент, ЗНАЧЕНИЕ(Справочник.Контрагенты.ПустаяСсылка)) КАК Контрагент,
|             ЕСТЬNULL(ВЗ_ПланПеремещений.Продавец, ЗНАЧЕНИЕ(Справочник.Пользователи.ПустаяСсылка)) КАК Продавец,
|             ЕСТЬNULL(ВЗ_ПланПеремещений.СкладОтправитель, ЗНАЧЕНИЕ(Справочник.СкладыКомпании.ПустаяСсылка)) КАК СкладОтправитель,
|             ЕСТЬNULL(ВЗ_ПланПеремещений.СкладПолучатель, ЗНАЧЕНИЕ(Справочник.СкладыКомпании.ПустаяСсылка)) КАК СкладПолучатель,
|             ЕСТЬNULL(ВЗ_ПланПеремещений.ДопОборудование, ЛОЖЬ) КАК ДопОборудование,
|             ЕСТЬNULL(ВЗ_ПланПеремещений.Комментарий, """") КАК Комментарий,
|             ЕСТЬNULL(ВЗ_ПланПеремещений.Ответственный, ЗНАЧЕНИЕ(Справочник.Пользователи.ПустаяСсылка)) КАК Ответственный,
|             ЕСТЬNULL(ВЗ_ПланПеремещений.ДатаЗаписи, ДАТАВРЕМЯ(1, 1, 1, 0, 0, 0)) КАК ДатаЗаписи,
|             ЕСТЬNULL(ОстаткиАвтомобилейОстатки.СкладКомпании, ЗНАЧЕНИЕ(Справочник.СкладыКомпании.ПустаяСсылка)) КАК ТекущийСклад,
|             ВЫБОР
|                             КОГДА ВЗ_ПланПеремещений.Автомобиль ЕСТЬ NULL 
|                                             ТОГДА ЛОЖЬ
|                             ИНАЧЕ ИСТИНА
|             КОНЕЦ КАК ЭтоЗапись,
|             ВЫБОР
|                             КОГДА ЕСТЬNULL(ВЗ_ПустыеЗаписи.ДатаВремя, ВЗ_ПланПеремещений.ДатаПлан) < &ДатаЗапретаИзменения
|                                             ТОГДА ИСТИНА
|                             ИНАЧЕ ЛОЖЬ
|             КОНЕЦ КАК НельзяИзменять,
|   ЕСТЬNULL(ВЗ_ПланПеремещений.VIN, """") КАК VIN,
|   ЕСТЬNULL(ВЗ_ПланПеремещений.КомментарийСлужбыПП, """") КАК КомментарийСлужбыПП,
|   ЕСТЬNULL(ВЗ_ПланПеремещений.Статус, """") КАК Статус,
|   ЕСТЬNULL(ВЗ_ПланПеремещений.ВнутреннийНомер, """") КАК ВнутреннийНомер,
|   ЕСТЬNULL(ВЗ_ПланПеремещений.РабочиеОтметки, """") КАК РабочиеОтметки,
|   ВЗ_ПланПеремещений.ЗаявкаНаПеремещение КАк ЗаявкаНаПеремещение,
|   ВЗ_ПланПеремещений.СозданДокументПеремещения КАк СозданДокументПеремещения,
|   ЕСТЬNULL(ВЗ_ПланПеремещений.СтатусПеремещения, ""Заявка"") КАК СтатусЗаявки,
|   ВЗ_ПланПеремещений.ЗаписьЗаблокирована
|ИЗ
|             (ВЫБРАТЬ
|                             ДОБАВИТЬКДАТЕ(ДОБАВИТЬКДАТЕ(НАЧАЛОПЕРИОДА(&ВыводимаяДата, ДЕНЬ), МИНУТА, ЕСТЬNULL(ВЗ_Время.Минут, 0)), ЧАС, ЕСТЬNULL(ВЗ_Время.Часов, 0)) КАК ДатаВремя
|             ИЗ
|                             (//ТекстВремени) КАК ВЗ_Время
|             ГДЕ
|                             (НЕ ВЗ_Время.Часов ЕСТЬ NULL )
|                             И (НЕ ВЗ_Время.Минут ЕСТЬ NULL )) КАК ВЗ_ПустыеЗаписи
|                             ПОЛНОЕ СОЕДИНЕНИЕ (ВЫБРАТЬ
|	ПланПеремещений.ДатаПлан КАК ДатаПлан,
|	ПланПеремещений.Автомобиль КАК Автомобиль,
|	ПланПеремещений.Контрагент КАК Контрагент,
|	ПланПеремещений.Продавец КАК Продавец,
|	ПланПеремещений.СкладОтправитель КАК СкладОтправитель,
|	ПланПеремещений.СкладПолучатель КАК СкладПолучатель,
|	ПланПеремещений.ДопОборудование КАК ДопОборудование,
|	ПланПеремещений.Комментарий КАК Комментарий,
|	ПланПеремещений.Ответственный КАК Ответственный,
|	ПланПеремещений.ДатаЗаписи КАК ДатаЗаписи,
|	ПланПеремещений.РабочиеОтметки КАК РабочиеОтметки,
|	ПланПеремещений.Автомобиль.VIN КАК VIN,
|	ПланПеремещений.ПотребностьПеремещения КАК ЗаявкаНаПеремещение,
|	ВЫБОР КОГДА ПланПеремещений.ДокументПеремещения = Значение(Документ.ПеремещениеАвтомобилей.ПустаяСсылка) Тогда
|   ЛОЖЬ ИНАЧЕ ИСТИНА КОНЕЦ КАК СозданДокументПеремещения,
|	ВЗ_КомментарииКАвтомобилям.Комментарий КАК КомментарийСлужбыПП,
|	Renault_ПотребностьПеремещения.Статус КАК Статус,
|	Renault_РазмещениеАвтомобилей.Место КАК ВнутреннийНомер,
|	ПеремещениеАвтомобилейАвтомобили.Ссылка.DMS_Статус КАК СтатусПеремещения,
|	ПланПеремещений.ЗаписьЗаблокирована КАК ЗаписьЗаблокирована
|ИЗ
|	РегистрСведений.Renault_ПланПеремещения КАК ПланПеремещений
|		ЛЕВОЕ СОЕДИНЕНИЕ (ВЫБРАТЬ
|			Renault_КомментарииКАвтомобилю.Автомобиль КАК Автомобиль,
|			Renault_КомментарииКАвтомобилю.Комментарий КАК Комментарий
|		ИЗ
|			РегистрСведений.Renault_КомментарииКАвтомобилю КАК Renault_КомментарииКАвтомобилю
|		ГДЕ
|			Renault_КомментарииКАвтомобилю.Автомобиль.Ссылка ЕСТЬ НЕ NULL ) КАК ВЗ_КомментарииКАвтомобилям
|		ПО ПланПеремещений.Автомобиль = ВЗ_КомментарииКАвтомобилям.Автомобиль
|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.Renault_РазмещениеАвтомобилей КАК Renault_РазмещениеАвтомобилей
|		ПО (ВЫБОР
|				КОГДА ПланПеремещений.Автомобиль <> ЗНАЧЕНИЕ(Справочник.Автомобили.ПустаяСсылка)
|					ТОГДА ПланПеремещений.Автомобиль = Renault_РазмещениеАвтомобилей.Автомобиль
|				ИНАЧЕ ЛОЖЬ
|			КОНЕЦ)
|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.Renault_ПотребностьПеремещения КАК Renault_ПотребностьПеремещения
|			ЛЕВОЕ СОЕДИНЕНИЕ Документ.ПеремещениеАвтомобилей.Автомобили КАК ПеремещениеАвтомобилейАвтомобили
|			ПО Renault_ПотребностьПеремещения.Ссылка = ПеремещениеАвтомобилейАвтомобили.DMS_Потребность
|			И ПеремещениеАвтомобилейАвтомобили.Ссылка.Проведен
|		ПО ПланПеремещений.ПотребностьПеремещения = Renault_ПотребностьПеремещения.Ссылка
|		И Renault_ПотребностьПеремещения.Проведен
|ГДЕ
|	(ПланПеремещений.Автомобиль <> ЗНАЧЕНИЕ(Справочник.Автомобили.ПустаяСсылка)
|			ИЛИ ПланПеремещений.Зарезервировано = ИСТИНА
|			ИЛИ ПланПеремещений.ЗаписьЗаблокирована = ИСТИНА)) КАК ВЗ_ПланПеремещений
|                                             ЛЕВОЕ СОЕДИНЕНИЕ РегистрНакопления.ОстаткиАвтомобилей.Остатки(&ТекущаяДата, ) КАК ОстаткиАвтомобилейОстатки
|                                             ПО ВЗ_ПланПеремещений.Автомобиль = ОстаткиАвтомобилейОстатки.Автомобиль
|                             ПО ВЗ_ПустыеЗаписи.ДатаВремя = ВЗ_ПланПеремещений.ДатаПлан
|ГДЕ
|             НАЧАЛОПЕРИОДА(ЕСТЬNULL(ВЗ_ПустыеЗаписи.ДатаВремя, ВЗ_ПланПеремещений.ДатаПлан), ДЕНЬ) = НАЧАЛОПЕРИОДА(&ВыводимаяДата, ДЕНЬ)";
